grevaillot/svd_tools/headers/STM32L4S5/dsi.h
/** @defgroup dsi_dsi_ier0 DSIIER0 DSI Host Interrupt Enable Register 0
@{*/

/** DSI_DSI_IER0_PE4IE PHY Error 4 Interrupt Enable **/
#define DSI_DSI_IER0_PE4IE		(1 << 20)
/** DSI_DSI_IER0_PE3IE PHY Error 3 Interrupt Enable **/
#define DSI_DSI_IER0_PE3IE		(1 << 19)
/** DSI_DSI_IER0_PE2IE PHY Error 2 Interrupt Enable **/
#define DSI_DSI_IER0_PE2IE		(1 << 18)
/** DSI_DSI_IER0_PE1IE PHY Error 1 Interrupt Enable **/
#define DSI_DSI_IER0_PE1IE		(1 << 17)
/** DSI_DSI_IER0_PE0IE PHY Error 0 Interrupt Enable **/
#define DSI_DSI_IER0_PE0IE		(1 << 16)
/** DSI_DSI_IER0_AE15IE Acknowledge Error 15 Interrupt Enable **/
#define DSI_DSI_IER0_AE15IE		(1 << 15)
/** DSI_DSI_IER0_AE14IE Acknowledge Error 14 Interrupt Enable **/
#define DSI_DSI_IER0_AE14IE		(1 << 14)
/** DSI_DSI_IER0_AE13IE Acknowledge Error 13 Interrupt Enable **/
#define DSI_DSI_IER0_AE13IE		(1 << 13)
/** DSI_DSI_IER0_AE12IE Acknowledge Error 12 Interrupt Enable **/
#define DSI_DSI_IER0_AE12IE		(1 << 12)
/** DSI_DSI_IER0_AE11IE Acknowledge Error 11 Interrupt Enable **/
#define DSI_DSI_IER0_AE11IE		(1 << 11)
/** DSI_DSI_IER0_AE10IE Acknowledge Error 10 Interrupt Enable **/
#define DSI_DSI_IER0_AE10IE		(1 << 10)
/** DSI_DSI_IER0_AE9IE Acknowledge Error 9 Interrupt Enable **/
#define DSI_DSI_IER0_AE9IE		(1 << 9)
/** DSI_DSI_IER0_AE8IE Acknowledge Error 8 Interrupt Enable **/
#define DSI_DSI_IER0_AE8IE		(1 << 8)
/** DSI_DSI_IER0_AE7IE Acknowledge Error 7 Interrupt Enable **/
#define DSI_DSI_IER0_AE7IE		(1 << 7)
/** DSI_DSI_IER0_AE6IE Acknowledge Error 6 Interrupt Enable **/
#define DSI_DSI_IER0_AE6IE		(1 << 6)
/** DSI_DSI_IER0_AE5IE Acknowledge Error 5 Interrupt Enable **/
#define DSI_DSI_IER0_AE5IE		(1 << 5)
/** DSI_DSI_IER0_AE4IE Acknowledge Error 4 Interrupt Enable **/
#define DSI_DSI_IER0_AE4IE		(1 << 4)
/** DSI_DSI_IER0_AE3IE Acknowledge Error 3 Interrupt Enable **/
#define DSI_DSI_IER0_AE3IE		(1 << 3)
/** DSI_DSI_IER0_AE2IE Acknowledge Error 2 Interrupt Enable **/
#define DSI_DSI_IER0_AE2IE		(1 << 2)
/** DSI_DSI_IER0_AE1IE Acknowledge Error 1 Interrupt Enable **/
#define DSI_DSI_IER0_AE1IE		(1 << 1)
/** DSI_DSI_IER0_AE0IE Acknowledge Error 0 Interrupt Enable **/
#define DSI_DSI_IER0_AE0IE		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_ier1 DSIIER1 DSI Host Interrupt Enable Register 1
@{*/

/** DSI_DSI_IER1_GPRXEIE Generic Payload Receive Error Interrupt Enable **/
#define DSI_DSI_IER1_GPRXEIE		(1 << 12)
/** DSI_DSI_IER1_GPRDEIE Generic Payload Read Error Interrupt Enable **/
#define DSI_DSI_IER1_GPRDEIE		(1 << 11)
/** DSI_DSI_IER1_GPTXEIE Generic Payload Transmit Error Interrupt Enable **/
#define DSI_DSI_IER1_GPTXEIE		(1 << 10)
/** DSI_DSI_IER1_GPWREIE Generic Payload Write Error Interrupt Enable **/
#define DSI_DSI_IER1_GPWREIE		(1 << 9)
/** DSI_DSI_IER1_GCWREIE Generic Command Write Error Interrupt Enable **/
#define DSI_DSI_IER1_GCWREIE		(1 << 8)
/** DSI_DSI_IER1_LPWREIE LTDC Payload Write Error Interrupt Enable **/
#define DSI_DSI_IER1_LPWREIE		(1 << 7)
/** DSI_DSI_IER1_EOTPEIE EoTp Error Interrupt Enable **/
#define DSI_DSI_IER1_EOTPEIE		(1 << 6)
/** DSI_DSI_IER1_PSEIE Packet Size Error Interrupt Enable **/
#define DSI_DSI_IER1_PSEIE		(1 << 5)
/** DSI_DSI_IER1_CRCEIE CRC Error Interrupt Enable **/
#define DSI_DSI_IER1_CRCEIE		(1 << 4)
/** DSI_DSI_IER1_ECCMEIE ECC Multi-bit Error Interrupt Enable **/
#define DSI_DSI_IER1_ECCMEIE		(1 << 3)
/** DSI_DSI_IER1_ECCSEIE ECC Single-bit Error Interrupt Enable **/
#define DSI_DSI_IER1_ECCSEIE		(1 << 2)
/** DSI_DSI_IER1_TOLPRXIE Timeout Low-Power Reception Interrupt Enable **/
#define DSI_DSI_IER1_TOLPRXIE		(1 << 1)
/** DSI_DSI_IER1_TOHSTXIE Timeout High-Speed Transmission Interrupt Enable **/
#define DSI_DSI_IER1_TOHSTXIE		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_fir0 DSIFIR0 DSI Host Force Interrupt Register 0
@{*/

/** DSI_DSI_FIR0_FPE4 Force PHY Error 4 **/
#define DSI_DSI_FIR0_FPE4		(1 << 20)
/** DSI_DSI_FIR0_FPE3 Force PHY Error 3 **/
#define DSI_DSI_FIR0_FPE3		(1 << 19)
/** DSI_DSI_FIR0_FPE2 Force PHY Error 2 **/
#define DSI_DSI_FIR0_FPE2		(1 << 18)
/** DSI_DSI_FIR0_FPE1 Force PHY Error 1 **/
#define DSI_DSI_FIR0_FPE1		(1 << 17)
/** DSI_DSI_FIR0_FPE0 Force PHY Error 0 **/
#define DSI_DSI_FIR0_FPE0		(1 << 16)
/** DSI_DSI_FIR0_FAE15 Force Acknowledge Error 15 **/
#define DSI_DSI_FIR0_FAE15		(1 << 15)
/** DSI_DSI_FIR0_FAE14 Force Acknowledge Error 14 **/
#define DSI_DSI_FIR0_FAE14		(1 << 14)
/** DSI_DSI_FIR0_FAE13 Force Acknowledge Error 13 **/
#define DSI_DSI_FIR0_FAE13		(1 << 13)
/** DSI_DSI_FIR0_FAE12 Force Acknowledge Error 12 **/
#define DSI_DSI_FIR0_FAE12		(1 << 12)
/** DSI_DSI_FIR0_FAE11 Force Acknowledge Error 11 **/
#define DSI_DSI_FIR0_FAE11		(1 << 11)
/** DSI_DSI_FIR0_FAE10 Force Acknowledge Error 10 **/
#define DSI_DSI_FIR0_FAE10		(1 << 10)
/** DSI_DSI_FIR0_FAE9 Force Acknowledge Error 9 **/
#define DSI_DSI_FIR0_FAE9		(1 << 9)
/** DSI_DSI_FIR0_FAE8 Force Acknowledge Error 8 **/
#define DSI_DSI_FIR0_FAE8		(1 << 8)
/** DSI_DSI_FIR0_FAE7 Force Acknowledge Error 7 **/
#define DSI_DSI_FIR0_FAE7		(1 << 7)
/** DSI_DSI_FIR0_FAE6 Force Acknowledge Error 6 **/
#define DSI_DSI_FIR0_FAE6		(1 << 6)
/** DSI_DSI_FIR0_FAE5 Force Acknowledge Error 5 **/
#define DSI_DSI_FIR0_FAE5		(1 << 5)
/** DSI_DSI_FIR0_FAE4 Force Acknowledge Error 4 **/
#define DSI_DSI_FIR0_FAE4		(1 << 4)
/** DSI_DSI_FIR0_FAE3 Force Acknowledge Error 3 **/
#define DSI_DSI_FIR0_FAE3		(1 << 3)
/** DSI_DSI_FIR0_FAE2 Force Acknowledge Error 2 **/
#define DSI_DSI_FIR0_FAE2		(1 << 2)
/** DSI_DSI_FIR0_FAE1 Force Acknowledge Error 1 **/
#define DSI_DSI_FIR0_FAE1		(1 << 1)
/** DSI_DSI_FIR0_FAE0 Force Acknowledge Error 0 **/
#define DSI_DSI_FIR0_FAE0		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_fir1 DSIFIR1 DSI Host Force Interrupt Register 1
@{*/

/** DSI_DSI_FIR1_FGPRXE Force Generic Payload Receive Error **/
#define DSI_DSI_FIR1_FGPRXE		(1 << 12)
/** DSI_DSI_FIR1_FGPRDE Force Generic Payload Read Error **/
#define DSI_DSI_FIR1_FGPRDE		(1 << 11)
/** DSI_DSI_FIR1_FGPTXE Force Generic Payload Transmit Error **/
#define DSI_DSI_FIR1_FGPTXE		(1 << 10)
/** DSI_DSI_FIR1_FGPWRE Force Generic Payload Write Error **/
#define DSI_DSI_FIR1_FGPWRE		(1 << 9)
/** DSI_DSI_FIR1_FGCWRE Force Generic Command Write Error **/
#define DSI_DSI_FIR1_FGCWRE		(1 << 8)
/** DSI_DSI_FIR1_FLPWRE Force LTDC Payload Write Error **/
#define DSI_DSI_FIR1_FLPWRE		(1 << 7)
/** DSI_DSI_FIR1_FEOTPE Force EoTp Error **/
#define DSI_DSI_FIR1_FEOTPE		(1 << 6)
/** DSI_DSI_FIR1_FPSE Force Packet Size Error **/
#define DSI_DSI_FIR1_FPSE		(1 << 5)
/** DSI_DSI_FIR1_FCRCE Force CRC Error **/
#define DSI_DSI_FIR1_FCRCE		(1 << 4)
/** DSI_DSI_FIR1_FECCME Force ECC Multi-bit Error **/
#define DSI_DSI_FIR1_FECCME		(1 << 3)
/** DSI_DSI_FIR1_FECCSE Force ECC Single-bit Error **/
#define DSI_DSI_FIR1_FECCSE		(1 << 2)
/** DSI_DSI_FIR1_FTOLPRX Force Timeout Low-Power Reception **/
#define DSI_DSI_FIR1_FTOLPRX		(1 << 1)
/** DSI_DSI_FIR1_FTOHSTX Force Timeout High-Speed Transmission **/
#define DSI_DSI_FIR1_FTOHSTX		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_vscr DSIVSCR DSI Host Video Shadow Control Register
@{*/

