grevaillot/svd_tools/headers/STM32L4S5/dsi.h
/** DSI_DSI_WISR_RRIF Regulator Ready Interrupt Flag **/
#define DSI_DSI_WISR_RRIF		(1 << 13)
/** DSI_DSI_WISR_RRS Regulator Ready Status **/
#define DSI_DSI_WISR_RRS		(1 << 12)
/** DSI_DSI_WISR_PLLUIF PLL Unlock Interrupt Flag **/
#define DSI_DSI_WISR_PLLUIF		(1 << 10)
/** DSI_DSI_WISR_PLLLIF PLL Lock Interrupt Flag **/
#define DSI_DSI_WISR_PLLLIF		(1 << 9)
/** DSI_DSI_WISR_PLLLS PLL Lock Status **/
#define DSI_DSI_WISR_PLLLS		(1 << 8)
/** DSI_DSI_WISR_BUSY Busy Flag **/
#define DSI_DSI_WISR_BUSY		(1 << 2)
/** DSI_DSI_WISR_ERIF End of Refresh Interrupt Flag **/
#define DSI_DSI_WISR_ERIF		(1 << 1)
/** DSI_DSI_WISR_TEIF Tearing Effect Interrupt Flag **/
#define DSI_DSI_WISR_TEIF		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_wifcr DSIWIFCR DSI Wrapper Interrupt Flag Clear Register
@{*/

/** DSI_DSI_WIFCR_CRRIF Clear Regulator Ready Interrupt Flag **/
#define DSI_DSI_WIFCR_CRRIF		(1 << 13)
/** DSI_DSI_WIFCR_CPLLUIF Clear PLL Unlock Interrupt Flag **/
#define DSI_DSI_WIFCR_CPLLUIF		(1 << 10)
/** DSI_DSI_WIFCR_CPLLLIF Clear PLL Lock Interrupt Flag **/
#define DSI_DSI_WIFCR_CPLLLIF		(1 << 9)
/** DSI_DSI_WIFCR_CERIF Clear End of Refresh Interrupt Flag **/
#define DSI_DSI_WIFCR_CERIF		(1 << 1)
/** DSI_DSI_WIFCR_CTEIF Clear Tearing Effect Interrupt Flag **/
#define DSI_DSI_WIFCR_CTEIF		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_wpcr1 DSIWPCR1 DSI Wrapper PHY Configuration Register 1
@{*/

/** DSI_DSI_WPCR1_TCLKPOSTEN custom time for tCLK-POST Enable **/
#define DSI_DSI_WPCR1_TCLKPOSTEN		(1 << 27)
/** DSI_DSI_WPCR1_TLPXCEN custom time for tLPX for Clock lane Enable **/
#define DSI_DSI_WPCR1_TLPXCEN		(1 << 26)
/** DSI_DSI_WPCR1_THSEXITEN custom time for tHS-EXIT Enable **/
#define DSI_DSI_WPCR1_THSEXITEN		(1 << 25)
/** DSI_DSI_WPCR1_TLPXDEN custom time for tLPX for Data lanes Enable **/
#define DSI_DSI_WPCR1_TLPXDEN		(1 << 24)
/** DSI_DSI_WPCR1_THSZEROEN custom time for tHS-ZERO Enable **/
#define DSI_DSI_WPCR1_THSZEROEN		(1 << 23)
/** DSI_DSI_WPCR1_THSTRAILEN custom time for tHS-TRAIL Enable **/
#define DSI_DSI_WPCR1_THSTRAILEN		(1 << 22)
/** DSI_DSI_WPCR1_THSPREPEN custom time for tHS-PREPARE Enable **/
#define DSI_DSI_WPCR1_THSPREPEN		(1 << 21)
/** DSI_DSI_WPCR1_TCLKZEROEN custom time for tCLK-ZERO Enable **/
#define DSI_DSI_WPCR1_TCLKZEROEN		(1 << 20)
/** DSI_DSI_WPCR1_TCLKPREPEN custom time for tCLK-PREPARE Enable **/
#define DSI_DSI_WPCR1_TCLKPREPEN		(1 << 19)
/** DSI_DSI_WPCR1_PDEN Pull-Down Enable **/
#define DSI_DSI_WPCR1_PDEN		(1 << 18)
/** DSI_DSI_WPCR1_TDDL Turn Disable Data Lanes **/
#define DSI_DSI_WPCR1_TDDL		(1 << 16)
/** DSI_DSI_WPCR1_CDOFFDL Contention Detection OFF on Data Lanes **/
#define DSI_DSI_WPCR1_CDOFFDL		(1 << 14)
/** DSI_DSI_WPCR1_FTXSMDL Force in TX Stop Mode the Data Lanes **/
#define DSI_DSI_WPCR1_FTXSMDL		(1 << 13)
/** DSI_DSI_WPCR1_FTXSMCL Force in TX Stop Mode the Clock Lane **/
#define DSI_DSI_WPCR1_FTXSMCL		(1 << 12)
/** DSI_DSI_WPCR1_HSIDL1 Invert the High-Speed data signal on Data Lane 1 **/
#define DSI_DSI_WPCR1_HSIDL1		(1 << 11)
/** DSI_DSI_WPCR1_HSIDL0 Invert the Hight-Speed data signal on Data Lane 0 **/
#define DSI_DSI_WPCR1_HSIDL0		(1 << 10)
/** DSI_DSI_WPCR1_HSICL Invert Hight-Speed data signal on Clock Lane **/
#define DSI_DSI_WPCR1_HSICL		(1 << 9)
/** DSI_DSI_WPCR1_SWDL1 Swap Data Lane 1 pins **/
#define DSI_DSI_WPCR1_SWDL1		(1 << 8)
/** DSI_DSI_WPCR1_SWDL0 Swap Data Lane 0 pins **/
#define DSI_DSI_WPCR1_SWDL0		(1 << 7)
/** DSI_DSI_WPCR1_SWCL Swap Clock Lane pins **/
#define DSI_DSI_WPCR1_SWCL		(1 << 6)

#define DSI_DSI_WPCR1_UIX4_SHIFT		0
#define DSI_DSI_WPCR1_UIX4_MASK		0x3f
/** @defgroup dsi_dsi_wpcr1_uix4 UIX4 Unit Interval multiplied by 4
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_wpcr2 DSIWPCR2 DSI Wrapper PHY Configuration Register 2
@{*/


#define DSI_DSI_WPCR2_LPRXFT_SHIFT		25
#define DSI_DSI_WPCR2_LPRXFT_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_lprxft LPRXFT Low-Power RX low-pass Filtering Tuning
@{*/
/**@}*/

/** DSI_DSI_WPCR2_FLPRXLPM Forces LP Receiver in Low-Power Mode **/
#define DSI_DSI_WPCR2_FLPRXLPM		(1 << 22)

#define DSI_DSI_WPCR2_HSTXSRCDL_SHIFT		18
#define DSI_DSI_WPCR2_HSTXSRCDL_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_hstxsrcdl HSTXSRCDL High-Speed Transmission Slew Rate Control on Data Lanes
@{*/
/**@}*/


#define DSI_DSI_WPCR2_HSTXSRCCL_SHIFT		16
#define DSI_DSI_WPCR2_HSTXSRCCL_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_hstxsrccl HSTXSRCCL High-Speed Transmission Slew Rate Control on Clock Lane
@{*/
/**@}*/

/** DSI_DSI_WPCR2_SDCC SDD Control **/
#define DSI_DSI_WPCR2_SDCC		(1 << 12)

#define DSI_DSI_WPCR2_LPSRDL_SHIFT		8
#define DSI_DSI_WPCR2_LPSRDL_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_lpsrdl LPSRDL Low-Power transmission Slew Rate Compensation on Data Lanes
@{*/
/**@}*/


#define DSI_DSI_WPCR2_LPSRCL_SHIFT		6
#define DSI_DSI_WPCR2_LPSRCL_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_lpsrcl LPSRCL Low-Power transmission Slew Rate Compensation on Clock Lane
@{*/
/**@}*/


#define DSI_DSI_WPCR2_HSTXDLL_SHIFT		2
#define DSI_DSI_WPCR2_HSTXDLL_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_hstxdll HSTXDLL High-Speed Transmission Delay on Data Lanes
@{*/
/**@}*/


#define DSI_DSI_WPCR2_HSTXDCL_SHIFT		0
#define DSI_DSI_WPCR2_HSTXDCL_MASK		0x03
/** @defgroup dsi_dsi_wpcr2_hstxdcl HSTXDCL High-Speed Transmission Delay on Clock Lane
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_wpcr3 DSIWPCR3 DSI Wrapper PHY Configuration Register 3
@{*/


#define DSI_DSI_WPCR3_THSTRAIL_SHIFT		24
#define DSI_DSI_WPCR3_THSTRAIL_MASK		0xff
/** @defgroup dsi_dsi_wpcr3_thstrail THSTRAIL tHSTRAIL
@{*/
/**@}*/


#define DSI_DSI_WPCR3_THSPREP_SHIFT		16
#define DSI_DSI_WPCR3_THSPREP_MASK		0xff
/** @defgroup dsi_dsi_wpcr3_thsprep THSPREP tHS-PREPARE
@{*/
/**@}*/


#define DSI_DSI_WPCR3_TCLKZEO_SHIFT		8
#define DSI_DSI_WPCR3_TCLKZEO_MASK		0xff
/** @defgroup dsi_dsi_wpcr3_tclkzeo TCLKZEO tCLK-ZERO
@{*/
/**@}*/


#define DSI_DSI_WPCR3_TCLKPREP_SHIFT		0
#define DSI_DSI_WPCR3_TCLKPREP_MASK		0xff
/** @defgroup dsi_dsi_wpcr3_tclkprep TCLKPREP tCLK-PREPARE
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_wpcr4 DSIWPCR4 DSI_WPCR4
@{*/


#define DSI_DSI_WPCR4_TLPXC_SHIFT		24
#define DSI_DSI_WPCR4_TLPXC_MASK		0xff
/** @defgroup dsi_dsi_wpcr4_tlpxc TLPXC tLPXC for Clock lane
@{*/
/**@}*/


#define DSI_DSI_WPCR4_THSEXIT_SHIFT		16
#define DSI_DSI_WPCR4_THSEXIT_MASK		0xff
/** @defgroup dsi_dsi_wpcr4_thsexit THSEXIT tHSEXIT
@{*/
/**@}*/


#define DSI_DSI_WPCR4_TLPXD_SHIFT		8
#define DSI_DSI_WPCR4_TLPXD_MASK		0xff
/** @defgroup dsi_dsi_wpcr4_tlpxd TLPXD tLPX for Data lanes
@{*/
/**@}*/


#define DSI_DSI_WPCR4_THSZERO_SHIFT		0
#define DSI_DSI_WPCR4_THSZERO_MASK		0xff
/** @defgroup dsi_dsi_wpcr4_thszero THSZERO tHS-ZERO
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_wpcr5 DSIWPCR5 DSI Wrapper PHY Configuration Register 5
@{*/


#define DSI_DSI_WPCR5_THSZERO_SHIFT		0
#define DSI_DSI_WPCR5_THSZERO_MASK		0xff
/** @defgroup dsi_dsi_wpcr5_thszero THSZERO tCLK-POST
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_wrpcr DSIWRPCR DSI Wrapper Regulator and PLL Control Register
@{*/

/** DSI_DSI_WRPCR_REGEN Regulator Enable **/
#define DSI_DSI_WRPCR_REGEN		(1 << 24)

#define DSI_DSI_WRPCR_ODF_SHIFT		16
#define DSI_DSI_WRPCR_ODF_MASK		0x03
/** @defgroup dsi_dsi_wrpcr_odf ODF PLL Output Division Factor
@{*/
/**@}*/


#define DSI_DSI_WRPCR_IDF_SHIFT		11
#define DSI_DSI_WRPCR_IDF_MASK		0x0f
/** @defgroup dsi_dsi_wrpcr_idf IDF PLL Input Division Factor
@{*/
/**@}*/


#define DSI_DSI_WRPCR_NDIV_SHIFT		2
#define DSI_DSI_WRPCR_NDIV_MASK		0x7f
/** @defgroup dsi_dsi_wrpcr_ndiv NDIV PLL Loop Division Factor
@{*/
/**@}*/

/** DSI_DSI_WRPCR_PLLEN PLL Enable **/
#define DSI_DSI_WRPCR_PLLEN		(1 << 0)

/**@}*/
